mp = list() # Cтворюємо масив, де зберігатимемо мапу приміщення. Якщо кубик належить стіні, бататреї або обігрівачу, то в масиві він приймає значення False, а якщо він заповнений повітрям, то приймає значення False
a = list() # Створюємо масив, де зберігатиметься температура кожного кубика


import numpy as np # Імпортуємо функцію numpy для роботи з масивами 


CSVData = open('temp.csv') # Зчитуємо дані з файлу temp.csv, де зберігаються дані про температуру кожного кубика
a = np.loadtxt(CSVData, delimiter=";")
CSVData = open('map.csv') # Зчитуємо дані з файлу map.csv, де зберігаються дані про те, чи заповнений кубик повітрям
mp = np.loadtxt(CSVData, delimiter=";")
mp = mp.astype('bool')

zmt = a.copy()


for i in range(len(a)): # Створюємо масив, де зберігатимемо дані про те, наскільки зміниться температура кожного кубика. Цей масив буде такої самої розмірності, що й mp і a, але в початкоий момент часу всі його елементи будуть дорівнювати 0
    for j in range(len(a[0])):
        zmt[i][j] = 0




dt = 10 #Обереемо проміжок часу, за який відбуватиметься перенесення кількості теплоти. В цьому прикладі це буде 10с
dx = 0.1 #Оберемо довжину грані кубика. В цьому прикладі це буде 0.1 м
dS=0.01 #Обчислимо площу, через яку між 2 кубиками переноситиметься кількість теплоти. dS = dx**2

xa = 0.026 #коефіцієнт теплопередачі повітря
ca = 1000 #питома теплоємність повітря


m = 0.00129 #маса повітря в одному кубику

for t in range(1,10): #Обираємо, скільки часу відбуватиметься перенесення кількості теплоти
    for y in range(0,len(a)-1): # Ця частина йде вкладеним циклом по усіх елеентах масиву і рахуватиме зміну теператури для кожної клітинки
        for x in range(0,len(a[0])-1):
                #Рахуємо зміну температури для правої клітинки спираючись на формулу 2.7
                zt = (xa*(a[y][x+1] - a[y][x])*dS*dt)/(dx*ca*m)
                if zt>0:
                    if mp[y][x] == False: 
                        zmt[y][x] = zmt[y][x] + abs(zt)
                    if mp[y][x+1] == False: 
                        zmt[y][x+1] = zmt[y][x+1] - abs(zt)
                else: 
                    if mp[y][x] == False:
                        zmt[y][x] = zmt[y][x] - abs(zt)
                    if mp[y][x+1] == False:
                        zmt[y][x+1] = zmt[y][x+1] + abs(zt)
                #Рахуємо зміну температури для нижньої клітинки
                zt = (xa*(a[y+1][x] - a[y][x])*dS*dt)/(dx*ca*m)
                if zt>0:
                    if mp[y][x] == False:
                        zmt[y][x] = zmt[y][x] + abs(zt)
                    if mp[y+1][x] == False:
                        zmt[y+1][x] = zmt[y+1][x] - abs(zt)
                else:
                    if mp[y][x] == False:
                        zmt[y][x] = zmt[y][x] - abs(zt)
                    if mp[y+1][x] == False:
                        zmt[y+1][x] = zmt[y+1][x] + abs(zt)
    #Тепер до кожної теператури в масиві a додаватимемо відповідну зміну з масиву zmt, округлюючи до 1 знаку після коми, а значення в масиві zmt обнулятимемо                   
    for y in range(1,len(a)-1):
        for x in range(1,len(a[0])-1):
            a[y][x] = round(a[y][x]+zmt[y][x],1)
            zmt[y][x] = 0

#Ця частина виводить температури в кімнаті, після усіх змін
for elem in a:
    print(*elem)
